Tekla Open API Reference for Tekla Structures 2025
IUIEvents Events
The IUIEvents type exposes the following members.
Events
Name | Description
DocumentManagerClosed
 The DocumentManagerClosed eventis raised when the document manager is closed.
DrawingEditorClosed
 The DrawingEditorClosed event is raised when the drawing editor is closed.
DrawingEditorOpened
 The DrawingEditorOpened event is raised when the drawing editor is opened.
DrawingListSelectionChanged
 The DrawingListSelectionChanged event is raised when selection on the drawing list has changed.
DrawingLoaded
 The DrawingLoaded event is raised when a new drawing is opened in the drawing editor.
Interrupted
 Occurs when user interrupts.
SelectionChange
 The SelectionChange event is raised when the selection is changed in a Tekla Structures drawing.
Top
See Also
Reference
IUIEvents Interface
Tekla.Structures.Drawing.UI Namespace